'''
Дан список чисел. Определите, локолько в нём
встречается различных чисел.
'''
list1 = [1,2,1,3,5,5,7]
print(len(set(list1)))